app/Controllers/Dashboard.php

   public function index(){
       // inisiasi objek dari class KabupatenModel
       $kabupaten = new KabupatenModel();
       // ambil data dari tabel kabupaten
       // angka 1 mengacu pada data id_kabupaten di tabel kabupaten
       // artinya mencari data id_kabupaten = 1
       $data['kabupaten'] = $kabupaten->find(1);
       // menampilkan file views/dashboard.php di browser
       // mengirimkan data kabupaten melalui variabel $data

       // inisiasi object dari class UniversitasModel
       $universitas = new UniversitasModel();
       // mengambil semua data universitas
       $query = $universitas->findAll();
---
SELECT *
FROM `universitas`

    public function getdata(){
        // inisiasi object dari class KecamatanModel
        $kecamatan = new KecamatanModel();
        // mengambil kode_kecamatan yang dikirim oleh AJAX
        $kode_kecamatan = $this->request->getGet('kode_kecamatan');
        // melakukan pencarian ke tabel kecamatan berdasarkan kode kecamatan
        $data = $kecamatan->find($kode_kecamatan);
---
SELECT *
FROM `kecamatan`
WHERE `kecamatan`.`kode_kecamatan` = '3302160'