app/Controllers/Universitas.php

SELECT *
FROM `universitas`
JOIN `kecamatan` ON `kecamatan`.`kode_kecamatan` = `universitas`.`kode_kecamatan`
---
    public function tampil() {
        $universitas = new UniversitasModel();
        // Mengambil semua data di tabel universitas dan kecamatan menggunakan JOIN
        $data['query'] = $universitas->join('kecamatan', 'kecamatan.kode_kecamatan = universitas.kode_kecamatan')->findAll();

SELECT *
FROM `kecamatan`
---
    public function tambah() {
        $kecamatan = new KecamatanModel();
        $kecamatan = $kecamatan->findAll();

SELECT *
FROM `kecamatan`
SELECT *
FROM `universitas`
WHERE `universitas`.`no_universitas` = '623321'
---
    public function edit($no_universitas) {
        $kecamatan = new KecamatanModel();
        $kecamatan = $kecamatan->findAll();
        $kecamatanOptions = array();
        $kecamatanOptions[''] = 'belum dipilih';
        foreach ($kecamatan as $row) {
            $kecamatanOptions[$row->kode_kecamatan] = strtoupper($row->nama_kecamatan);
        }
        $data['kecamatanOptions'] = $kecamatanOptions;
        $universitas = new UniversitasModel();
        // Mengambil data universitas sesuai nilai pada $no_universitas
        $data['query'] = $universitas->find($no_universitas);